{
    "info": [
        "Course Syllabus\n Edit\n[Tentative until this line is removed]\nWelcome to CSC148! This course, Introduction to Computer Science, introduces you to how\ncomputer scientists think in a systematic way about computing. Our goal is to provide you with skills\nfor approaching program design in a principled way, using techniques such as encapsulation,\nmodularity, information-hiding, comparing different implementations for efficiency, and building\npowerful data structures.\nThe material posted on Quercus is required reading. It contains important information: assignment\nhandouts, the policy on missed work, links to the online discussion forum (Piazza), the\nannouncements page, and more. You are responsible for all announcements made in lecture and on\nQuercus.\nTable of Contents:\nContact Information\nGetting Help\nLectures\nCreating a Positive Learning Environment\nPrerequisites\nTextbook\nCourse Software\nMarking Scheme\nAssignments\nLabs\nSpecial Consideration\nMidterm Remark Requests\nAcademic Integrity\nAccessibility Needs\nContact Information\nJonathan Calver is the Course Coordinator, which means that he and the Instructional Support staff",
        "Jonathan Calver is the Course Coordinator, which means that he and the Instructional Support staff\ndeal with all administrative issues. Sophia Huynh is the Lab Coordinator, which means she deals with\nall issues related to the weekly preps and labs.\nJonathan Calver Sophia Huynh\nInstructor Diane Horton Joonho Kim\n(Course Coordinator) (Lab Coordinator)\nL0101\nT1-3\nL0401/L0402 L0201 L0501\nR1-2\nLectures W3-5 T3-5 T6-9\nIn-person F4-5 L0301 R3-4\nW1-3\nF1-2\nOffice Hour\nOffice Hours (https://q.utoronto.ca/courses/336881/pages/office-hours)\nCalendar\ncsc148-2024-01@cs.toronto.edu (mailto:csc148-2024-01@cs.toronto.edu)\nPlease send email from your UofT address.\nCourse email\nInclude your full name and UTORid in the body of the email.\naccount\nPlease do not use Quercus messaging for anything related to CSC148.\nDiscussion Board Piazza (https://piazza.com/utoronto.ca/winter2024/csc148h1)\nMarkUs link [to be added once MarkUs is set up]\nGetting Help\nDiscussion Board: for sharable questions\nPlease post your questions about the course material and assignments on our Piazza discussion\nboard so that everyone can benefit from your questions and answers. Helping someone else learn is\none of the most effective ways of deeply learning a subject.\nWe will monitor the discussion board regularly, but it may take longer to get answers near due dates,\nso try to start assignments early in case you have questions. Answers to frequently asked questions",
        "so try to start assignments early in case you have questions. Answers to frequently asked questions\nwill be posted on Piazza throughout the term.\nGroup Office Hours: for sharable questions\nGroup Office Hours will be held in person, in a meeting or tutorial room. We will go over concepts,\nexamples, etc. based on your requests. You are welcome to bring whatever is bugging you, or just to\nlisten and meet other students.\nInstructor and TA office hours: for everything\nThere will be many hours each week of instructor and TA office hours, and more in the week prior to\neach assignment due date. These will be a mix of online and in-person. See the Office Hours\ncalendar (https://q.utoronto.ca/courses/336881/pages/office-hours) for the most up-to-date schedule\nthroughout the term.\nCourse email account: for personal matters\nPlease use the course email account, csc148-2024-01@cs.toronto.edu (mailto:csc148-2024-\n01@cs.toronto.edu) for personal matters such as missing course work due to illness. Course content\nquestions should be directed to piazza or office hours.\nLectures\nActive Learning\nDuring lectures, we will present material and demonstrate problem solving for part of the time. There\nwill also regularly be activities that you participate in. Be prepared to get your gears turning in class!\nThere is very strong evidence, and our experience also shows, that active learning is more effective\nthan passively listening to a lecture — and it tends to be a lot more fun!\nRecordings\nLectures for sections L0101, L0301, and L0401/0402 will be recorded. Students in any section who\nare unable to attend class on a given day can view the corresponding recording through the OCCS\nStudent App. Viewing the recorded materials will provide a poorer experience than participating\nactively in class, so we hope that everyone who can attend and participate will choose to do that. If\nyou are unable to attend a lecture, we encourage you to consider attending another section or finding\na group of students to work through the active learning activities with outside of lecture time.\nCopyright",
        "Copyright\nCourse videos and materials belong to the instructor, the University, and/or other source depending\non the specific facts of each situation, and are protected by copyright. In this course, you are\npermitted to download videos and course materials for your own academic use, but you should not\ncopy, share, or use them for any other purpose without the explicit permission of the instructors.\nLabs\nAfter lectures each week, you will participate in a two-hour lab, where you will reinforce and extend\nyour learning from lecture that week. The first labs are the week of January 15th; there are no labs\nthe first week of the course. Like lectures, all tutorials start at 10 minutes past the hour. You must\nregister for a lab section (TUT____) on ACORN, separate from your lecture section. You are\nallowed to pick any lab time independent of your lecture time.\nWe have designed the labs to not simply be a repeat of work you did in lecture, but to give you\ndifferent kinds of opportunities to problem-solve and practice what you've learned. See Policies and\nGuidelines: Weekly Labs (https://q.utoronto.ca/courses/336881/pages/policies-and-guidelines-weekly-\nlabs) for more information about the labs.\nCreating a Positive Learning Environment\nWe are committed to creating a respectful learning environment in computer science courses for all\nstudents and expect that you will adhere to the University of Toronto Code of Student Conduct\n(http://www.viceprovoststudents.utoronto.ca/publicationsandpolicies/codeofstudentconduct.htm) . Please\nbe mindful of how your behavior influences the atmosphere in our learning community, not just in\nlectures and labs, but also in office hours, in online forums, and anywhere that you interact with other\nstudents and members of the department.\nPrerequisites\nCSC108 or equivalent programming experience is assumed. We'll be using Python in the course, but\ncomfort with other imperative programming languages like Java or C should be fine. There will be a\nrampup session during the first weekend of term for students whose background is not in Python or\nwho feel they need a refresher. Details will be posted on Quercus closer to the date.\nHere are some links to CSC108 materials and general advice:",
        "Advice on choosing your first-year courses (https://web.cs.toronto.edu/undergraduate/first-\nyear-courses) (skip down to \"Which introductory course is right for you?\")\nInformation about the CSC108 textbook (https://pragprog.com/titles/gwpy3/practical-\nprogramming-third-edition/)\nCSC108 Youtube channel\n(https://www.youtube.com/channel/UCu8NnRGTGxHe96Le0xqLrNQ/videos)\nCoursera course 1 (https://www.coursera.org/course/programming1) and Coursera course 2\n(https://www.coursera.org/course/programming2)\nTextbook\nWe'll be using online lecture notes (https://www.teach.cs.toronto.edu/~csc148h/notes/) throughout\nthe term; this is your required reading for this course. Keeping up with these readings will put you in\ngreat shape to succeed in this course!\nCourse Software\nFor information about the software we'll use for this course, please see the Software Guide\n(https://q.utoronto.ca/courses/336881/pages/software-guide) .\nAssessments and Grading Scheme\nYou will complete four major kinds of assessments in this course: weekly preparation exercises, labs,\nassignments, and tests/exams. You will also complete a module on Embedded Ethics in computing.\nAssessment Weight Notes\n1% each; best 8 of 9; due Tuesdays at 11AM\n9 \"prep\" exercises 8%\nPrep 1 is not for credit, but try to complete it before\nyour first lecture.",
        "setup and\ndebugging activity 1% due Tuesday January 16 at 11AM\n(\"lab 1\")\n8 labs\n(called \"TUT\" on 7% 1% each; best 7 of 8\nAcorn)\nAssignment 0 5% due Monday February 5 at 6PM\nDuring class time on Tuesday February 13 and\nMidterm 15%\nWednesday February 14.\nAssignment 1 10% due Monday March 4 at 6PM\nAssignment 2 10% due Monday March 25 at 6PM\nPre-module survey due before the module\n2% total: during the week of March 25; exact date will be\nannounced\nEmbedded Ethics 2 surveys: 0.5%\nWritten exercise due Friday April 5 before\nModule each\n5:00pm\nWritten exercise:\nPost-module survey due Friday April 5 before\n1%\n5:00pm\nDuring the final assessment period.\nYou must earn 40% or above on the final exam\nFinal Exam 42%\nto pass the course; otherwise, your final\ncourse grade will be no higher than 47%.\nMissed Midterms",
        "We are not able to offer a makeup midterm. For a student who misses the midterm, you can submit\nthe special consideration form to request that the weight be shifted to the final exam.\nAssignment Policies\nAssignments must be submitted electronically, using the MarkUs online system. Be sure to confirm\nthat you have submitted all the required files and the correct version of each; we cannot accept\nmissing files or a different version of an already-submitted file after the due date. Make sure to run\nany provided self-tests on MarkUs to confirm we are able to run your code.\nPlease see Policies and Guidelines: Assignments\n(https://q.utoronto.ca/courses/336881/pages/policies-and-guidelines-assignments) for additional details.\nWorking with a Partner\nAll weekly preps and Assignment 0 must be done individually. For Assignment 1 and Assignment 2,\nyou have the option of partnering with one other CSC148 student. For each of these assignments,\nyou may choose your own partner, from any section of the course on the St. George campus. Both\npartners will receive the same mark for the assignment. Additional details will be provided in the\nassignment handouts.\nWorking with a partner has the potential to lighten your workload and to increase your learning, or to\nmake things worse. It all depends on how well you work together. Remember that you are\nresponsible for learning the course material underlying all parts of the assignments. You will\nhave the most success if you truly work collaboratively.\nSpecial Consideration\nStudents experiencing illness or other emergencies that prevent them from being able to complete\nhomework on time, or write a test, can request special consideration. You will be required to affirm\nthat you are abiding by the Code of Behaviour on Academic Matters\n(http://www.governingcouncil.utoronto.ca/Assets/Governing+Council+Digital+Assets/Policies/PDF/ppjun011995.pdf)\n, in particular, to be aware that it is an academic offence\nto engage in any form of cheating, academic dishonesty or misconduct, fraud or misrepresentation\nnot herein otherwise described, in order to obtain academic credit or other academic advantage of\nany kind\nThat is, you must be truly experiencing an emergency, and acknowledge that to falsely claim so is an",
        "That is, you must be truly experiencing an emergency, and acknowledge that to falsely claim so is an\nacademic offence. Making a request does not guarantee that you will be granted special\nconsideration.\nSpecial Consideration Request Form (https://forms.office.com/r/kyQPtWGXvN)\n(read the policy details carefully before submitting a request!)\nMidterm Remark Requests\nMistakes sometimes happen when marking. If you feel there is an issue with the marking of your test,\nyou may request that it be remarked.\nRemark requests are accepted for two weeks after the midterm test is returned, and will be completed\nbefore the final grades are submitted at the end of the term.\nYou must give a specific reason for your request, referring to a possible error or omission by the\nmarker. Remark requests without a specific reason will not be accepted. We may regrade your entire\nsubmission when processing your request. A remark request may result in your midterm grade going\nup or down.\nWe will make a Quercus announcement after the test results are released with details on how to\nrequest a remark.\nAcademic Integrity\nAll of the work you submit must be done by you, and your work must not be submitted by someone\nelse. Plagiarism is academic fraud and is taken very seriously. The department uses software that\ncompares programs for evidence of similar code. Please read the Rules and Regulations from the U\nof T Governing Council (especially the Code of Behaviour on Academic Matters\n(http://www.governingcouncil.utoronto.ca/policies/behaveac.htm) ).\nPlease also see the information for students from the Office of Student Academic Integrity\n(https://www.artsci.utoronto.ca/current/academic-advising-and-support/student-academic-integrity) .\nPlease don’t copy. We want you to succeed and are here to help. Completing your assigned work is\nthe best way to ensure you are ready to perform well on the final exam. Please see Academic\nIntegrity in CSC148 (https://q.utoronto.ca/courses/336881/pages/academic-integrity-in-csc148) for\nadditional advice.",
        "Policy on generative AI (including ChatGPT)\nIn this course, you may use generative artificial intelligence (AI) tools, including ChatGPT and GitHub\nCopilot, as learning aids and to help complete weekly preps and assignments. You will not be\npermitted to use generative AI on the midterm test or final exam. While some generative AI tools are\ncurrently available for free in Canada, please be warned that these tools have not been vetted by the\nUniversity of Toronto and might not meet University guidelines or requirements for privacy, intellectual\nproperty, security, accessibility, and records retention. Generative AI may produce content which is\nincorrect or misleading, or inconsistent with the expectations of this course. These tools may be\nsubject to service interruptions, software modifications, and pricing changes during the semester.\nGenerative AI is not required to complete any aspect of this course, and we caution you to not\nrely on these tools to complete your coursework. Instead, we recommend treating generative AI as a\nsupplementary tool only for exploration or drafting content. Ultimately, you (and not any AI tool) are\nresponsible for your own learning in this course, and for all the work you submit for credit. It is your\nresponsibility to critically evaluate the content generated, and to regularly assess your own learning\nindependent of generative AI tools. Overreliance on generative AI may give you a false sense of how\nmuch you’ve actually learned, which can lead to poor performance on the midterm test or final exam,\nin later courses, or in future work or studies after graduation.\nYour course work\nWork that you complete for CSC148 (including exercises, assignments, and tests) may not be shared\nwith other students or published. This policy is to both protect the intellectual property of course staff\n(including, for example, the design and starter files for assignments), and to protect you from\ncommitting acts of academic dishonesty. For more information on this topic, see the Department of\nComputer Science website (https://web.cs.toronto.edu/undergraduate/portfolio-advice) .\nGitHub (https://www.github.com) is a popular option for computer science students and professionals\nto both collaborate in teams and publish their work online, including to develop a portfolio for potential\nemployers. As we said in the Academic Integrity section, you should not put your work publicly on\nGitHub. However, you may use GitHub's private repositories to store your own work, and work with\na group on course assignments. (See GitHub's instructions for creating a repository\n(https://docs.github.com/en/github/getting-started-with-github/create-a-repo) and select \"Private\" in Step\n4.)",
        "Accessibility Needs\nThe University of Toronto is committed to accessibility. If you require accommodations or have any\naccessibility concerns, please visit http://www.studentlife.utoronto.ca/as/new-registration\n(http://www.studentlife.utoronto.ca/as/new-registration) as soon as possible.\nStudents who require accommodations need to register with Test & Exam Services."
    ],
    "skills": [
        "http://data.europa.eu/esco/skill/9d9ba780-4aa2-43d2-888c-95a41a713fb9",
        "http://data.europa.eu/esco/skill/f5dd06b8-5d17-4932-9d03-957d0c4f5051",
        "http://data.europa.eu/esco/skill/fc3cdc2c-7b79-4b5c-a4b0-f3b996fef849",
        "http://data.europa.eu/esco/skill/e2103a1d-4a84-47a9-b4f7-774787573449",
        "http://data.europa.eu/esco/skill/3e23db60-0c3d-498a-a6ac-ffbed0ecb033",
        "http://data.europa.eu/esco/skill/118efbcd-8fc5-4668-81d1-c383a0d16070",
        "http://data.europa.eu/esco/skill/edd6a6bc-139c-45de-8f1a-d0ea353f45ab",
        "http://data.europa.eu/esco/skill/e9575f7f-053a-439e-8074-f93df3334e92",
        "http://data.europa.eu/esco/skill/5def6c02-b8fa-4fb4-a73c-1ea02cbe4ca3",
        "http://data.europa.eu/esco/skill/53103efa-a525-4a5b-81e5-282c4331e72c",
        "http://data.europa.eu/esco/skill/3012a059-e062-4171-b37e-f9e7c7eb603e",
        "http://data.europa.eu/esco/skill/dd06c2e2-ecf7-4ce8-9f12-ae5d935071f2",
        "http://data.europa.eu/esco/skill/d1f73ae9-d348-4aac-b5d5-9b6d508401d3",
        "http://data.europa.eu/esco/skill/abbf6f61-04eb-4e1a-9694-05ba28ac38bf",
        "http://data.europa.eu/esco/skill/198f62a5-dadb-4653-80fe-0108e8af7cd3",
        "http://data.europa.eu/esco/skill/1b1cf435-46ba-4471-afda-5029b36b3862",
        "http://data.europa.eu/esco/skill/9bf266a6-188b-4d17-a22f-2f266d76832b",
        "http://data.europa.eu/esco/skill/199f7919-5114-41b6-b6a5-41e0e4896ec1",
        "http://data.europa.eu/esco/skill/10c42c72-ecaa-414c-a014-7e97fcecae8d",
        "http://data.europa.eu/esco/skill/24c39caf-6f4d-4fa1-bd54-2eb917c0dfde",
        "http://data.europa.eu/esco/skill/d4789070-2ff7-4bbb-94ca-8bb1739826a9",
        "http://data.europa.eu/esco/skill/c58050e1-0774-4097-93d2-07dd7ba6a27a",
        "http://data.europa.eu/esco/skill/e952e573-6a42-4d57-ab9e-70902547cf48",
        "http://data.europa.eu/esco/skill/aaf57e19-0d41-4361-8de9-bcd858e3f10d",
        "http://data.europa.eu/esco/skill/d6c29154-9cc1-48a4-a2de-3d1d0d7f0831",
        "http://data.europa.eu/esco/skill/5cede168-97f8-47a4-89fd-8f7188c55c5d",
        "http://data.europa.eu/esco/skill/b820c9de-4d00-4e79-9af9-33f26044ff42",
        "http://data.europa.eu/esco/skill/833289fa-3646-4010-9d9e-93ba8c9ef2d8",
        "http://data.europa.eu/esco/skill/731101d9-94bc-4805-bff4-9578d1bf03b5",
        "http://data.europa.eu/esco/skill/7537779b-152c-49e0-ad65-861e0419c01d",
        "http://data.europa.eu/esco/skill/7c3865d1-e5a9-4043-a7a4-2e9e30468c0b",
        "http://data.europa.eu/esco/skill/1de3942b-99d8-41e8-9ef0-fbc9e9f6307b",
        "http://data.europa.eu/esco/skill/7fc4c18a-68f3-425a-aadf-f83633be47a1",
        "http://data.europa.eu/esco/skill/be64bb4c-84ac-4c83-8cc7-fc8593e15136",
        "http://data.europa.eu/esco/skill/fdf15b35-9028-4acb-bfd2-43f00a015cd9",
        "http://data.europa.eu/esco/skill/3ca9b968-03ae-47c8-b428-f0e22861191b",
        "http://data.europa.eu/esco/skill/c68e4cc4-b842-4660-a84c-48f11c70f657",
        "http://data.europa.eu/esco/skill/5a42eaf5-93bb-4bca-8ebd-4d78e96e4929",
        "http://data.europa.eu/esco/skill/b1a1149a-9bc5-468d-9d09-f6d171cfd619",
        "http://data.europa.eu/esco/skill/6542601c-92ee-4a03-abd9-fde0635727a2",
        "http://data.europa.eu/esco/skill/74a5e8b1-dc44-4a03-b4f2-ad06966128c6",
        "http://data.europa.eu/esco/skill/f08e2bd6-0366-4948-a670-1f03f130126f",
        "http://data.europa.eu/esco/skill/2f0a426f-3b95-455b-a872-ef6dee168114",
        "http://data.europa.eu/esco/skill/a17286c5-238d-4f0b-bc24-29e9121345de",
        "http://data.europa.eu/esco/skill/21d2f96d-35f7-4e3f-9745-c533d2dd6e97",
        "http://data.europa.eu/esco/skill/5a3c7fa1-4f0d-4ede-8e5e-734a2afa5ca7",
        "http://data.europa.eu/esco/skill/99a810d0-4f58-4397-8b86-760dff174565",
        "http://data.europa.eu/esco/skill/f7091334-10da-4ad6-b74a-8528a01a03f4",
        "http://data.europa.eu/esco/skill/eb65ce8e-61bf-49d1-99bb-cb699ba1005b",
        "http://data.europa.eu/esco/skill/418765cd-77f9-4c6f-8b00-e56ebec767bb",
        "http://data.europa.eu/esco/skill/fecf8a0d-62c4-4e71-9b03-0f4fc2ad7bf5",
        "http://data.europa.eu/esco/skill/a44c0ed6-68b1-457a-9c6d-ea8487bdfeb2",
        "http://data.europa.eu/esco/skill/3c73898b-04a6-4e3a-b84a-3a032277c916",
        "http://data.europa.eu/esco/skill/f8e7c608-a92d-4b61-b84f-e2453b0aa4a4",
        "http://data.europa.eu/esco/skill/7dd94ad3-13d6-43fe-8b94-51fcbf67ced9",
        "http://data.europa.eu/esco/skill/f9738fc9-4d67-43e8-bfda-954123e34d42",
        "http://data.europa.eu/esco/skill/63e21f22-0aa9-4337-87e4-46e8008f1524",
        "http://data.europa.eu/esco/skill/c3a03c5a-c260-4c26-9b9a-873abb396f4d",
        "http://data.europa.eu/esco/skill/f266380e-9830-44db-8f93-60a6e8b9a1b6",
        "http://data.europa.eu/esco/skill/0ad58425-0691-4da4-b89b-eaa15c09c142",
        "http://data.europa.eu/esco/skill/128f0b4c-8da7-467b-9196-7c691e067a1e",
        "http://data.europa.eu/esco/skill/b4e083dd-e532-4bd5-870a-3815f8c94950",
        "http://data.europa.eu/esco/skill/e2c884e4-4952-4a5c-ba69-ad406b66bd7d",
        "http://data.europa.eu/esco/skill/cb58bfc2-696d-4b45-8f01-283b612a6c9a",
        "http://data.europa.eu/esco/skill/e5d1f825-60ed-4bdd-872a-e748c387f777",
        "http://data.europa.eu/esco/skill/2ad081e6-0a3f-4612-ac15-7ace75d39e26",
        "http://data.europa.eu/esco/skill/79c96922-6032-40d6-b391-0f4a0d85e620",
        "http://data.europa.eu/esco/skill/a886afe5-6a20-40ac-b660-562d46f94d9e",
        "http://data.europa.eu/esco/skill/bb979b3b-8292-409f-8c27-b17e13bab8bb",
        "http://data.europa.eu/esco/skill/5b26f08b-88bc-45f0-b901-530d7786466b",
        "http://data.europa.eu/esco/skill/011711eb-f20b-4d64-84d7-17b8979946dc",
        "http://data.europa.eu/esco/skill/3cd304db-9df0-4f22-9759-9ed86155876c",
        "http://data.europa.eu/esco/skill/699e7c26-6502-4e78-a823-3656ff5a5b8b",
        "http://data.europa.eu/esco/skill/58fcd942-3019-4498-b685-6b2727b37031",
        "http://data.europa.eu/esco/skill/1618ee1c-6753-456e-a171-3d7e5f75404a",
        "http://data.europa.eu/esco/skill/adc6dc11-3376-467b-96c5-9b0a21edc869",
        "http://data.europa.eu/esco/skill/cdf83a12-56d4-4e3c-ad0b-af1c1f21c62a",
        "http://data.europa.eu/esco/skill/f642d7ed-e8d7-4355-a747-b85094d4e2e3",
        "http://data.europa.eu/esco/skill/d56a2182-14e0-4319-ab2f-0133aa67672b",
        "http://data.europa.eu/esco/skill/6469f571-ba92-4528-8b9f-ad9faa51e42e",
        "http://data.europa.eu/esco/skill/c0733631-0c5e-4b5c-a291-aad52ca493ce",
        "http://data.europa.eu/esco/skill/4a2a63e6-5c62-43a0-a375-fdf4c2805270",
        "http://data.europa.eu/esco/skill/4377dd26-a0d6-497c-9ffe-f59308d36648",
        "http://data.europa.eu/esco/skill/6c80d53c-d8c9-41fe-998f-091fca208834",
        "http://data.europa.eu/esco/skill/28f637e1-15fc-462d-ba10-5908fd438a0e",
        "http://data.europa.eu/esco/skill/1c2b578b-829e-4ef7-b709-c77dd51d457c",
        "http://data.europa.eu/esco/skill/e3145bd7-7f35-44ec-a5dc-4417c5c9ab9a",
        "http://data.europa.eu/esco/skill/7d10fcb2-b368-48ab-996b-7c9fafcf68ed",
        "http://data.europa.eu/esco/skill/7b5cce4d-c7fe-4119-b48f-70aa05391787",
        "http://data.europa.eu/esco/skill/afe9c5d2-e8bd-4377-9d2d-49b9589f05f9",
        "http://data.europa.eu/esco/skill/de134835-030e-4f79-9873-e87c34c1a0db",
        "http://data.europa.eu/esco/skill/d2564da5-c21f-4c02-8887-c78a001bb183",
        "http://data.europa.eu/esco/skill/d18527e9-68ee-4977-965d-84a366dce971",
        "http://data.europa.eu/esco/skill/48616ec6-5116-4e95-afd9-379fd7ab49f0",
        "http://data.europa.eu/esco/skill/6345d3a4-7d1a-40a9-9a82-6ed06beffe7b",
        "http://data.europa.eu/esco/skill/c0ccbd15-36f3-4515-ae0b-b4062d225ee2",
        "http://data.europa.eu/esco/skill/54e60889-c5cc-435f-8d6d-7aefb67e993a",
        "http://data.europa.eu/esco/skill/ccd0a1d9-afda-43d9-b901-96344886e14d",
        "http://data.europa.eu/esco/skill/113b4428-0a31-4199-8496-070af7854b91",
        "http://data.europa.eu/esco/skill/f75b740c-b36c-495e-bc67-efe347bbc6b5",
        "http://data.europa.eu/esco/skill/20a8fe89-d4eb-4698-8521-8881c13377e0",
        "http://data.europa.eu/esco/skill/383955b1-9059-47e4-9028-67bb2fdb6be6",
        "http://data.europa.eu/esco/skill/31b67516-af16-4b97-8430-a8a8e0f84190",
        "http://data.europa.eu/esco/skill/20012caa-b63c-4cb9-b2b8-01a1cfdfc1d1",
        "http://data.europa.eu/esco/skill/b6f26b50-3914-46ff-8f88-3defb71e007a",
        "http://data.europa.eu/esco/skill/3506d31c-3bb0-4a6d-90bb-aff03bca01b5",
        "http://data.europa.eu/esco/skill/55c16653-343c-4d02-a9de-7d8e864a4592",
        "http://data.europa.eu/esco/skill/f18bb25a-2e7b-499d-89d6-b5896d047a01",
        "http://data.europa.eu/esco/skill/6c7e5e01-a372-4674-aa7c-589eb9e9448a"
    ],
    "skill_name": [
        "prepare syllabuses for vocational courses",
        "publishing strategy",
        "use automatic programming",
        "mix live images",
        "create new concepts",
        "teach primary education class content",
        "coordinate security",
        "perform office routine activities",
        "computer science",
        "learning difficulties",
        "laboratory-based sciences",
        "propose leisure activities",
        "good laboratory practice",
        "mark lumber",
        "data models",
        "evaluate writings in response to feedback",
        "analyze  the credit history of potential customers",
        "make artistic food creations",
        "serve on academic committee",
        "compile course material",
        "verify feasibility",
        "use learning strategies",
        "intellectual property law",
        "assign homework",
        "meet commitments",
        "submit preliminary artwork",
        "authoring software",
        "Drupal",
        "online job platforms",
        "assessment processes",
        "show responsibility",
        "customize  drafts",
        "assist with personal administration issues",
        "use personal organization software",
        "maintain privacy",
        "Codenvy",
        "weigh materials",
        "build set constructions",
        "customize  software for drive system",
        "write Catalan",
        "legal department processes",
        "abide by regulations on banned materials",
        "computer programming",
        "participate in scientific colloquia",
        "prioritize requests",
        "marker making",
        "document your own practice",
        "perform resource planning",
        "government representation",
        "reprography",
        "adapt to new design materials",
        "set up dates",
        "follow up online user requests",
        "program  work according to incoming orders",
        "adhere to organizational  code of ethics",
        "MATLAB",
        "arrange student accommodation",
        "promote education course",
        "manufacturing of tools",
        "instruct others",
        "respond to electrical power contingencies",
        "learning management systems",
        "attend castings",
        "evaluate information",
        "organize supporters",
        "company policies",
        "grading systems",
        "expand the network of providers",
        "demonstrate willingness to learn",
        "perform liquid penetrant tests",
        "perform lectures",
        "CSS",
        "introduce new employees",
        "ICT accessibility standards",
        "Python",
        "provide radio services in emergencies",
        "manage university department",
        "radiation protection",
        "listen actively",
        "teach computer science",
        "set up projection equipment",
        "instructional design models",
        "maintain students' discipline",
        "handle helpdesk problems",
        "apply techniques for stacking goods into containers",
        "test system accessibility for users with special needs",
        "organize facilities for office personnel",
        "copyright legislation",
        "organize participation in local or international events",
        "learning technologies",
        "adapt existing designs to changed circumstances",
        "administer exams",
        "interact with the board of directors",
        "terminology",
        "show consideration for student's situation",
        "attend meetings",
        "undertake procedures to meet aircraft flight requirements",
        "value properties",
        "driving examinations"
    ]
}